; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image1 - mode
	thermograph8 - mode
	image3 - mode
	image6 - mode
	spectrograph5 - mode
	thermograph0 - mode
	spectrograph7 - mode
	infrared2 - mode
	infrared4 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star3 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph7)
	(supports instrument0 infrared2)
	(supports instrument0 infrared4)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph5)
	(supports instrument0 image6)
	(supports instrument0 image3)
	(supports instrument0 thermograph8)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(have_image Planet5 infrared2)
	(have_image Planet5 image1)
	(have_image Planet6 image1)
	(have_image Planet6 thermograph8)
	(have_image Planet6 thermograph0)
	(have_image Phenomenon7 infrared4)
	(have_image Phenomenon7 spectrograph5)
	(have_image Phenomenon7 thermograph0)
	(have_image Phenomenon8 spectrograph5)
	(have_image Planet9 thermograph8)
	(have_image Planet9 infrared4)
	(have_image Planet10 thermograph8)
	(have_image Planet10 infrared2)
	(have_image Star11 spectrograph5)
	(have_image Star11 infrared4)
	(have_image Planet12 infrared4)
	(have_image Planet12 thermograph8)
))

)

; plan
1. (turn_to satellite0 star3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star3)
   goals met: 0 of 17
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 17
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 17
4. (turn_to satellite0 planet6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet6)
   goals met: 0 of 17
5. (take_image satellite0 planet6 instrument0 thermograph8)
   added: (have_image planet6 thermograph8)
   goals met: 1 of 17
6. (take_image satellite0 planet6 instrument0 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 2 of 17
7. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   goals met: 3 of 17
8. (turn_to satellite0 planet12 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet12)
   goals met: 3 of 17
9. (take_image satellite0 planet12 instrument0 thermograph8)
   added: (have_image planet12 thermograph8)
   goals met: 4 of 17
10. (take_image satellite0 planet12 instrument0 infrared4)
   added: (have_image planet12 infrared4)
   goals met: 5 of 17
11. (turn_to satellite0 planet10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet10)
   goals met: 5 of 17
12. (take_image satellite0 planet10 instrument0 thermograph8)
   added: (have_image planet10 thermograph8)
   goals met: 6 of 17
13. (take_image satellite0 planet10 instrument0 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 7 of 17
14. (turn_to satellite0 phenomenon7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon7)
   goals met: 7 of 17
15. (take_image satellite0 phenomenon7 instrument0 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 8 of 17
16. (take_image satellite0 phenomenon7 instrument0 spectrograph5)
   added: (have_image phenomenon7 spectrograph5)
   goals met: 9 of 17
17. (take_image satellite0 phenomenon7 instrument0 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 10 of 17
18. (turn_to satellite0 phenomenon8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon8)
   goals met: 10 of 17
19. (take_image satellite0 phenomenon8 instrument0 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 11 of 17
20. (turn_to satellite0 planet5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet5)
   goals met: 11 of 17
21. (take_image satellite0 planet5 instrument0 image1)
   added: (have_image planet5 image1)
   goals met: 12 of 17
22. (take_image satellite0 planet5 instrument0 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 13 of 17
23. (turn_to satellite0 planet9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet9)
   goals met: 13 of 17
24. (take_image satellite0 planet9 instrument0 infrared4)
   added: (have_image planet9 infrared4)
   goals met: 14 of 17
25. (take_image satellite0 planet9 instrument0 thermograph8)
   added: (have_image planet9 thermograph8)
   goals met: 15 of 17
26. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 15 of 17
27. (take_image satellite0 star11 instrument0 infrared4)
   added: (have_image star11 infrared4)
   goals met: 16 of 17
28. (take_image satellite0 star11 instrument0 spectrograph5)
   added: (have_image star11 spectrograph5)
   goals met: 17 of 17
